// 기본적인 데이터 타입

// Stirng
"abc"

// Number
123

// Boolean
true
false

// Object
{ }
// 배열도 객체의 한 종류

// Null
null

// Undefined
undefined



// 기본적인 연산자



// 산술 연산자
" +, -, *, /, % "

// 문자열 + 문자열
"abc" + "def"
// 'abcdef'

// 문자열 + 숫자 
"100" + 5
// '1005' ( 문자열로 취급 )
100 + "5"
// '1005'

// 문자열 * 숫자
'100' * 10
// 1000 ( 숫자로 연산이 가능하면 연산 )
'abc' * 10
// NaN ( 숫자로 연산이 불가능하면 NaN )



// 비교 연산자
" <, >, <=, >=, ===, !== "

// 엄격한 동치 연산자 ===
" 데이터 타입과 값이 같아야 True "
10 === '10'
// false

// 느슨한 동치 연산자 ==
" 타입 비교 없이 값만 같으면 True "
10 == '10'
// true

// -> 엄격한 동치연산자 === 사용 권장



// 논리 연산자
" &&, ||, ! "